artifacts/events/syncpoint_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:tev="http://www.onvif.org/ver10/events/wsdl">
  <s:Header/>
  <s:Body>
    <tev:SetSynchronizationPoint/>
  </s:Body>
</s:Envelope>

