test/data/xml/pelco/PullMessages.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:wsa="http://www.w3.org/2005/08/addressing" 
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:tev="http://www.onvif.org/ver10/events/wsdl">
  <SubscriptionId 
    xmlns="urn:schemas-pelco-com:ws:addressing:1">urn:uuid:b19776f2-9426-64e5-c4a5-21f05962cbb4
  </SubscriptionId>
  <wsa:To s:mustUnderstand="1">http://10.10.1.66/onvif/eventing_service?id=urn:uuid:b19776f2-9426-64e5-c4a5-21f05962cbb4</wsa:To>
  <s:Header>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsse:Security s:mustUnderstand="1">
      <wsu:Timestamp wsu:Id="Time">
        <wsu:Created>2018-02-22T20:00:20.401Z</wsu:Created>
        <wsu:Expires>2018-02-22T20:00:30.401Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:UsernameToken wsu:Id="User">
        <wsse:Username>admin</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">0Pszsiwb8rv2s8txa3iF3DVdt8Y=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">zNBwRwEf2kxJ3PPG1G2pGw==</wsse:Nonce>
        <wsu:Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-22T20:00:20.401Z
        </wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </s:Header>
  <s:Body>
    <tev:PullMessages>
      <tt:Timeout>2018-02-22T20:00:25.953Z</tt:Timeout>
      <tt:MessageLimit>99</tt:MessageLimit>
    </tev:PullMessages>
  </s:Body>
</s:Envelope>