Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/Events/PullMessages/TC.EV.NVT.02_REQ_02.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:tet="http://www.onvif.org/ver10/events/wsdl">
 <SOAP-ENV:Header/>
<SOAP-ENV:Body>
    <tet:PullMessages>
      <tet:Timeout>P5S</tet:Timeout>
      <tet:MessageLimit>2</tet:MessageLimit>
    </tet:PullMessages>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>